In [117]:
import pandas as pd
import numpy as np

In [118]:
#creating series

s = pd.Series([1, 2, 3, 4, np.nan, 6, 7]) #np.nan creates a nan value
s

0    1.0
1    2.0
2    3.0
3    4.0
4    NaN
5    6.0
6    7.0
dtype: float64

In [119]:
#creating a range of dates using date_range()

dates = pd.date_range('27-05-2024', periods = 10) #in periods we can mention how much range we need
dates

DatetimeIndex(['2024-05-27', '2024-05-28', '2024-05-29', '2024-05-30',
               '2024-05-31', '2024-06-01', '2024-06-02', '2024-06-03',
               '2024-06-04', '2024-06-05'],
              dtype='datetime64[ns]', freq='D')

In [120]:
#creating a dataframe using the dates as index

df = pd.DataFrame(np.random.randn(10,5), index = dates, columns = list('ABCDE')) #randn generates random numbers thye 10 --> no .of rows, 5 -->no. of columns
df

                   A         B         C         D         E
2024-05-27 -1.847349  1.225306 -0.819385 -1.766611  0.732121
2024-05-28 -0.857740  0.473946  1.506883  1.447367  0.300583
2024-05-29 -0.867413  0.355178  0.426062  0.634558 -0.245765
2024-05-30 -1.010152  0.987235 -0.246609 -0.798666 -1.761010
2024-05-31  0.325654  0.762123  1.853665 -0.595162  0.225070
2024-06-01 -1.032362  0.445865 -0.461368 -0.379834 -0.465130
2024-06-02  1.312510 -0.113314 -0.021289  0.477682  0.993185
2024-06-03  0.812262 -2.022891  0.745910 -0.508935 -1.020313
2024-06-04  0.416587  0.162038 -2.112574  0.567182 -0.800631
2024-06-05 -1.108838 -0.978317  0.003675  0.866692  1.171139

In [121]:
#creating dataframe by using dictionary

df2 = pd.DataFrame (
{
  'a' : 1.0,
  'b' : pd.Timestamp('27-05-2024'),
  'c' : pd.Series (7, list(range(5)), dtype = 'float32'),
  'd' : np.array([8]*5, dtype = 'int'),
  'e' : pd.Categorical(['hi', 'hello', 'welcome', 'no', 'yes']),
  'f' : 'yupp'
}
)

df2

     a          b    c  d        e     f
0  1.0 2024-05-27  7.0  8       hi  yupp
1  1.0 2024-05-27  7.0  8    hello  yupp
2  1.0 2024-05-27  7.0  8  welcome  yupp
3  1.0 2024-05-27  7.0  8       no  yupp
4  1.0 2024-05-27  7.0  8      yes  yupp

In [122]:
df2.dtypes

a          float64
b    datetime64[s]
c          float32
d            int32
e         category
f           object
dtype: object

In [123]:
df.head() #by default it displays frist 5 rows

                   A         B         C         D         E
2024-05-27 -1.847349  1.225306 -0.819385 -1.766611  0.732121
2024-05-28 -0.857740  0.473946  1.506883  1.447367  0.300583
2024-05-29 -0.867413  0.355178  0.426062  0.634558 -0.245765
2024-05-30 -1.010152  0.987235 -0.246609 -0.798666 -1.761010
2024-05-31  0.325654  0.762123  1.853665 -0.595162  0.225070

In [124]:
df.tail(3) #it displays the last 3 rows

                   A         B         C         D         E
2024-06-03  0.812262 -2.022891  0.745910 -0.508935 -1.020313
2024-06-04  0.416587  0.162038 -2.112574  0.567182 -0.800631
2024-06-05 -1.108838 -0.978317  0.003675  0.866692  1.171139

In [125]:
df.index #diswplays the index

DatetimeIndex(['2024-05-27', '2024-05-28', '2024-05-29', '2024-05-30',
               '2024-05-31', '2024-06-01', '2024-06-02', '2024-06-03',
               '2024-06-04', '2024-06-05'],
              dtype='datetime64[ns]', freq='D')

In [126]:
df.columns #displays the columns

Index(['A', 'B', 'C', 'D', 'E'], dtype='object')

In [127]:
df.to_numpy() #converts dataframe to numpy

array([[-1.84734928,  1.22530571, -0.81938543, -1.76661111,  0.73212058],
       [-0.85773976,  0.47394584,  1.50688266,  1.44736684,  0.3005834 ],
       [-0.86741321,  0.35517761,  0.42606182,  0.63455753, -0.24576471],
       [-1.01015228,  0.98723499, -0.24660931, -0.7986663 , -1.76100995],
       [ 0.32565441,  0.76212266,  1.85366498, -0.59516217,  0.22507018],
       [-1.03236198,  0.44586454, -0.46136795, -0.37983442, -0.46513029],
       [ 1.3125101 , -0.11331436, -0.02128943,  0.47768195,  0.99318505],
       [ 0.8122618 , -2.02289055,  0.74591047, -0.50893512, -1.02031294],
       [ 0.41658709,  0.16203802, -2.11257405,  0.56718234, -0.80063124],
       [-1.10883813, -0.97831673,  0.00367508,  0.86669189,  1.17113909]])

In [128]:
df.describe() #describes about the data

               A          B          C          D          E
count  10.000000  10.000000  10.000000  10.000000  10.000000
mean   -0.385684   0.129717   0.087497  -0.005573  -0.087075
std     1.021494   0.973335   1.143903   0.961165   0.943935
min    -1.847349  -2.022891  -2.112574  -1.766611  -1.761010
25%    -1.026810  -0.044476  -0.407678  -0.573605  -0.716756
50%    -0.862576   0.400521  -0.008807   0.048924  -0.010347
75%     0.393854   0.690078   0.665948   0.617714   0.624236
max     1.312510   1.225306   1.853665   1.447367   1.171139

In [129]:
df.T #transpose the data

,2024-05-27,2024-05-28,2024-05-29,2024-05-30,2024-05-31,2024-06-01,2024-06-02,2024-06-03,2024-06-04,2024-06-05
A,-1.847349,-0.857740,-0.867413,-1.010152,0.325654,-1.032362,1.312510,0.812262,0.416587,-1.108838
B,1.225306,0.473946,0.355178,0.987235,0.762123,0.445865,-0.113314,-2.022891,0.162038,-0.978317
C,-0.819385,1.506883,0.426062,-0.246609,1.853665,-0.461368,-0.021289,0.745910,-2.112574,0.003675
D,-1.766611,1.447367,0.634558,-0.798666,-0.595162,-0.379834,0.477682,-0.508935,0.567182,0.866692
E,0.732121,0.300583,-0.245765,-1.761010,0.225070,-0.465130,0.993185,-1.020313,-0.800631,1.171139

In [130]:
df.sort_index(axis = 1, ascending = False) #order by descending

                   E         D         C         B         A
2024-05-27  0.732121 -1.766611 -0.819385  1.225306 -1.847349
2024-05-28  0.300583  1.447367  1.506883  0.473946 -0.857740
2024-05-29 -0.245765  0.634558  0.426062  0.355178 -0.867413
2024-05-30 -1.761010 -0.798666 -0.246609  0.987235 -1.010152
2024-05-31  0.225070 -0.595162  1.853665  0.762123  0.325654
2024-06-01 -0.465130 -0.379834 -0.461368  0.445865 -1.032362
2024-06-02  0.993185  0.477682 -0.021289 -0.113314  1.312510
2024-06-03 -1.020313 -0.508935  0.745910 -2.022891  0.812262
2024-06-04 -0.800631  0.567182 -2.112574  0.162038  0.416587
2024-06-05  1.171139  0.866692  0.003675 -0.978317 -1.108838

In [131]:
df.sort_values(by = 'A') #if we dont mention anything it orders by ascending

                   A         B         C         D         E
2024-05-27 -1.847349  1.225306 -0.819385 -1.766611  0.732121
2024-06-05 -1.108838 -0.978317  0.003675  0.866692  1.171139
2024-06-01 -1.032362  0.445865 -0.461368 -0.379834 -0.465130
2024-05-30 -1.010152  0.987235 -0.246609 -0.798666 -1.761010
2024-05-29 -0.867413  0.355178  0.426062  0.634558 -0.245765
2024-05-28 -0.857740  0.473946  1.506883  1.447367  0.300583
2024-05-31  0.325654  0.762123  1.853665 -0.595162  0.225070
2024-06-04  0.416587  0.162038 -2.112574  0.567182 -0.800631
2024-06-03  0.812262 -2.022891  0.745910 -0.508935 -1.020313
2024-06-02  1.312510 -0.113314 -0.021289  0.477682  0.993185

In [132]:
df['C'] #splits the refered column

2024-05-27   -0.819385
2024-05-28    1.506883
2024-05-29    0.426062
2024-05-30   -0.246609
2024-05-31    1.853665
2024-06-01   -0.461368
2024-06-02   -0.021289
2024-06-03    0.745910
2024-06-04   -2.112574
2024-06-05    0.003675
Freq: D, Name: C, dtype: float64

In [133]:
#selecting

df[0:3] #by mentioning index numbers

                   A         B         C         D         E
2024-05-27 -1.847349  1.225306 -0.819385 -1.766611  0.732121
2024-05-28 -0.857740  0.473946  1.506883  1.447367  0.300583
2024-05-29 -0.867413  0.355178  0.426062  0.634558 -0.245765

In [134]:
df['2024-05-27' : '2024-05-29'] #by using index values

                   A         B         C         D         E
2024-05-27 -1.847349  1.225306 -0.819385 -1.766611  0.732121
2024-05-28 -0.857740  0.473946  1.506883  1.447367  0.300583
2024-05-29 -0.867413  0.355178  0.426062  0.634558 -0.245765

In [135]:
#by using labels
df.loc[dates[0]]

A   -1.847349
B    1.225306
C   -0.819385
D   -1.766611
E    0.732121
Name: 2024-05-27 00:00:00, dtype: float64

In [136]:
df.loc[:,['A','C']]

                   A         C
2024-05-27 -1.847349 -0.819385
2024-05-28 -0.857740  1.506883
2024-05-29 -0.867413  0.426062
2024-05-30 -1.010152 -0.246609
2024-05-31  0.325654  1.853665
2024-06-01 -1.032362 -0.461368
2024-06-02  1.312510 -0.021289
2024-06-03  0.812262  0.745910
2024-06-04  0.416587 -2.112574
2024-06-05 -1.108838  0.003675

In [137]:
#by using both endpoints
df.loc['2024-05-27' : '2024-05-29', ['A', 'C']]

                   A         C
2024-05-27 -1.847349 -0.819385
2024-05-28 -0.857740  1.506883
2024-05-29 -0.867413  0.426062

In [138]:
df.loc['2024-05-27' : '2024-05-29', 'A' : 'C']

                   A         B         C
2024-05-27 -1.847349  1.225306 -0.819385
2024-05-28 -0.857740  0.473946  1.506883
2024-05-29 -0.867413  0.355178  0.426062

In [139]:
df.loc[dates[0], 'A']

-1.8473492817963841

In [140]:
df.at[dates[0], 'A']

-1.8473492817963841

In [141]:
#selecting by position
df.iloc[2]

A   -0.867413
B    0.355178
C    0.426062
D    0.634558
E   -0.245765
Name: 2024-05-29 00:00:00, dtype: float64

In [142]:
df.iloc[0:3, 0:3]

                   A         B         C
2024-05-27 -1.847349  1.225306 -0.819385
2024-05-28 -0.857740  0.473946  1.506883
2024-05-29 -0.867413  0.355178  0.426062

In [143]:
df.iloc[[0,2,4], [0,1,3]] #only selecting the needed rows

                   A         B         D
2024-05-27 -1.847349  1.225306 -1.766611
2024-05-29 -0.867413  0.355178  0.634558
2024-05-31  0.325654  0.762123 -0.595162

In [144]:
df.iloc[0:3, :]

                   A         B         C         D         E
2024-05-27 -1.847349  1.225306 -0.819385 -1.766611  0.732121
2024-05-28 -0.857740  0.473946  1.506883  1.447367  0.300583
2024-05-29 -0.867413  0.355178  0.426062  0.634558 -0.245765

In [145]:
df.iloc[:, :4]

                   A         B         C         D
2024-05-27 -1.847349  1.225306 -0.819385 -1.766611
2024-05-28 -0.857740  0.473946  1.506883  1.447367
2024-05-29 -0.867413  0.355178  0.426062  0.634558
2024-05-30 -1.010152  0.987235 -0.246609 -0.798666
2024-05-31  0.325654  0.762123  1.853665 -0.595162
2024-06-01 -1.032362  0.445865 -0.461368 -0.379834
2024-06-02  1.312510 -0.113314 -0.021289  0.477682
2024-06-03  0.812262 -2.022891  0.745910 -0.508935
2024-06-04  0.416587  0.162038 -2.112574  0.567182
2024-06-05 -1.108838 -0.978317  0.003675  0.866692

In [146]:
df.iloc[0,1]

1.2253057102880978

In [147]:
df.iat[0,0]

-1.8473492817963841

In [148]:
#boolean indexing
df[df['A'] > 0] #displays all the rows where the condition A is greater than true falls true

                   A         B         C         D         E
2024-05-31  0.325654  0.762123  1.853665 -0.595162  0.225070
2024-06-02  1.312510 -0.113314 -0.021289  0.477682  0.993185
2024-06-03  0.812262 -2.022891  0.745910 -0.508935 -1.020313
2024-06-04  0.416587  0.162038 -2.112574  0.567182 -0.800631

In [149]:
df[df > 0] #diplays all datas where the condition falls true otherwise shows NaN

                   A         B         C         D         E
2024-05-27       NaN  1.225306       NaN       NaN  0.732121
2024-05-28       NaN  0.473946  1.506883  1.447367  0.300583
2024-05-29       NaN  0.355178  0.426062  0.634558       NaN
2024-05-30       NaN  0.987235       NaN       NaN       NaN
2024-05-31  0.325654  0.762123  1.853665       NaN  0.225070
2024-06-01       NaN  0.445865       NaN       NaN       NaN
2024-06-02  1.312510       NaN       NaN  0.477682  0.993185
2024-06-03  0.812262       NaN  0.745910       NaN       NaN
2024-06-04  0.416587  0.162038       NaN  0.567182       NaN
2024-06-05       NaN       NaN  0.003675  0.866692  1.171139

In [150]:
#uisng isin method
df2 = df.copy()
df2['F'] = ['h', 'i', 'j', 'k', 'l', 'm', 'n', 'o', 'p', 'q']
df2[df2['F'].isin(['h', 'j'])]

                   A         B         C         D         E  F
2024-05-27 -1.847349  1.225306 -0.819385 -1.766611  0.732121  h
2024-05-29 -0.867413  0.355178  0.426062  0.634558 -0.245765  j

In [151]:
#setting

s1 = pd.Series([1,2,3,4,5])
print (s1)
s1 = pd.Series([1,2,3,4,5], index = pd.date_range('27-05-2024', periods = 5))
s1

0    1
1    2
2    3
3    4
4    5
dtype: int64

2024-05-27    1
2024-05-28    2
2024-05-29    3
2024-05-30    4
2024-05-31    5
Freq: D, dtype: int64

In [152]:
#setting values by label
df.loc[dates[0], 'A'] = 0 
df.at[dates[0], "A"] = 0
df #both gives same output

                   A         B         C         D         E
2024-05-27  0.000000  1.225306 -0.819385 -1.766611  0.732121
2024-05-28 -0.857740  0.473946  1.506883  1.447367  0.300583
2024-05-29 -0.867413  0.355178  0.426062  0.634558 -0.245765
2024-05-30 -1.010152  0.987235 -0.246609 -0.798666 -1.761010
2024-05-31  0.325654  0.762123  1.853665 -0.595162  0.225070
2024-06-01 -1.032362  0.445865 -0.461368 -0.379834 -0.465130
2024-06-02  1.312510 -0.113314 -0.021289  0.477682  0.993185
2024-06-03  0.812262 -2.022891  0.745910 -0.508935 -1.020313
2024-06-04  0.416587  0.162038 -2.112574  0.567182 -0.800631
2024-06-05 -1.108838 -0.978317  0.003675  0.866692  1.171139

In [153]:
#setting value by position
df.iloc[0,1] = 0
df.iat[0,1] = 0
df #both gives same output

                   A         B         C         D         E
2024-05-27  0.000000  0.000000 -0.819385 -1.766611  0.732121
2024-05-28 -0.857740  0.473946  1.506883  1.447367  0.300583
2024-05-29 -0.867413  0.355178  0.426062  0.634558 -0.245765
2024-05-30 -1.010152  0.987235 -0.246609 -0.798666 -1.761010
2024-05-31  0.325654  0.762123  1.853665 -0.595162  0.225070
2024-06-01 -1.032362  0.445865 -0.461368 -0.379834 -0.465130
2024-06-02  1.312510 -0.113314 -0.021289  0.477682  0.993185
2024-06-03  0.812262 -2.022891  0.745910 -0.508935 -1.020313
2024-06-04  0.416587  0.162038 -2.112574  0.567182 -0.800631
2024-06-05 -1.108838 -0.978317  0.003675  0.866692  1.171139

In [154]:
#assigning by numpy array
df.loc[:, 'D'] = np.array([5] * len(df))
df

                   A         B         C    D         E
2024-05-27  0.000000  0.000000 -0.819385  5.0  0.732121
2024-05-28 -0.857740  0.473946  1.506883  5.0  0.300583
2024-05-29 -0.867413  0.355178  0.426062  5.0 -0.245765
2024-05-30 -1.010152  0.987235 -0.246609  5.0 -1.761010
2024-05-31  0.325654  0.762123  1.853665  5.0  0.225070
2024-06-01 -1.032362  0.445865 -0.461368  5.0 -0.465130
2024-06-02  1.312510 -0.113314 -0.021289  5.0  0.993185
2024-06-03  0.812262 -2.022891  0.745910  5.0 -1.020313
2024-06-04  0.416587  0.162038 -2.112574  5.0 -0.800631
2024-06-05 -1.108838 -0.978317  0.003675  5.0  1.171139

In [155]:
#where operation with seting
df2 = df.copy()
df2[df2 > 1] = -df2
df2 #converts every postive value to negative

                   A         B         C    D         E
2024-05-27  0.000000  0.000000 -0.819385 -5.0  0.732121
2024-05-28 -0.857740  0.473946 -1.506883 -5.0  0.300583
2024-05-29 -0.867413  0.355178  0.426062 -5.0 -0.245765
2024-05-30 -1.010152  0.987235 -0.246609 -5.0 -1.761010
2024-05-31  0.325654  0.762123 -1.853665 -5.0  0.225070
2024-06-01 -1.032362  0.445865 -0.461368 -5.0 -0.465130
2024-06-02 -1.312510 -0.113314 -0.021289 -5.0  0.993185
2024-06-03  0.812262 -2.022891  0.745910 -5.0 -1.020313
2024-06-04  0.416587  0.162038 -2.112574 -5.0 -0.800631
2024-06-05 -1.108838 -0.978317  0.003675 -5.0 -1.171139

In [156]:
#missing data
df1 = df.reindex(index = dates [0:5], columns = list(df.columns) + ['F'])
df1.loc[dates[0]:dates[2], 'F'] = 2
df1 #it created a nan values in the empty columns

                   A         B         C    D         E    F
2024-05-27  0.000000  0.000000 -0.819385  5.0  0.732121  2.0
2024-05-28 -0.857740  0.473946  1.506883  5.0  0.300583  2.0
2024-05-29 -0.867413  0.355178  0.426062  5.0 -0.245765  2.0
2024-05-30 -1.010152  0.987235 -0.246609  5.0 -1.761010  NaN
2024-05-31  0.325654  0.762123  1.853665  5.0  0.225070  NaN

In [157]:
#drop nan values
df1.dropna()
df1.dropna(how = 'any') #both gives same output

                   A         B         C    D         E    F
2024-05-27  0.000000  0.000000 -0.819385  5.0  0.732121  2.0
2024-05-28 -0.857740  0.473946  1.506883  5.0  0.300583  2.0
2024-05-29 -0.867413  0.355178  0.426062  5.0 -0.245765  2.0

In [158]:
#fill nan values
df1.fillna(5)

                   A         B         C    D         E    F
2024-05-27  0.000000  0.000000 -0.819385  5.0  0.732121  2.0
2024-05-28 -0.857740  0.473946  1.506883  5.0  0.300583  2.0
2024-05-29 -0.867413  0.355178  0.426062  5.0 -0.245765  2.0
2024-05-30 -1.010152  0.987235 -0.246609  5.0 -1.761010  5.0
2024-05-31  0.325654  0.762123  1.853665  5.0  0.225070  5.0

In [159]:
#checking for nan values
df1.isna()

                A      B      C      D      E      F
2024-05-27  False  False  False  False  False  False
2024-05-28  False  False  False  False  False  False
2024-05-29  False  False  False  False  False  False
2024-05-30  False  False  False  False  False   True
2024-05-31  False  False  False  False  False   True

In [160]:
#shows the count of nan values
df1.isna().sum()

A    0
B    0
C    0
D    0
E    0
F    2
dtype: int64

In [161]:
#stats
df.mean() #calculate mean along columns

A   -0.200949
B    0.007186
C    0.087497
D    5.000000
E   -0.087075
dtype: float64

In [162]:
df.mean(axis = 1) #calculate mean over rows

2024-05-27    0.982547
2024-05-28    1.284734
2024-05-29    0.933612
2024-05-30    0.593893
2024-05-31    1.633302
2024-06-01    0.697401
2024-06-02    1.434218
2024-06-03    0.702994
2024-06-04    0.533084
2024-06-05    0.817532
Freq: D, dtype: float64

In [245]:
s = pd.Series([1, 3, 5, 7, 6, 8, 9, 10, 11, 12], index=dates).shift(-1)
s #the shift makes the last 4 values as nan and inserts the remaining the end values will be neglected

2024-05-27     3.0
2024-05-28     5.0
2024-05-29     7.0
2024-05-30     6.0
2024-05-31     8.0
2024-06-01     9.0
2024-06-02    10.0
2024-06-03    11.0
2024-06-04    12.0
2024-06-05     NaN
Freq: D, dtype: float64

In [164]:
df.sub(s, axis = 0)

                    A          B          C    D          E
2024-05-27  -6.000000  -6.000000  -6.819385 -1.0  -5.267879
2024-05-28  -8.857740  -7.526054  -6.493117 -3.0  -7.699417
2024-05-29  -9.867413  -8.644822  -8.573938 -4.0  -9.245765
2024-05-30 -11.010152  -9.012765 -10.246609 -5.0 -11.761010
2024-05-31 -10.674346 -10.237877  -9.146335 -6.0 -10.774930
2024-06-01 -13.032362 -11.554135 -12.461368 -7.0 -12.465130
2024-06-02        NaN        NaN        NaN  NaN        NaN
2024-06-03        NaN        NaN        NaN  NaN        NaN
2024-06-04        NaN        NaN        NaN  NaN        NaN
2024-06-05        NaN        NaN        NaN  NaN        NaN

In [165]:
df

                   A         B         C    D         E
2024-05-27  0.000000  0.000000 -0.819385  5.0  0.732121
2024-05-28 -0.857740  0.473946  1.506883  5.0  0.300583
2024-05-29 -0.867413  0.355178  0.426062  5.0 -0.245765
2024-05-30 -1.010152  0.987235 -0.246609  5.0 -1.761010
2024-05-31  0.325654  0.762123  1.853665  5.0  0.225070
2024-06-01 -1.032362  0.445865 -0.461368  5.0 -0.465130
2024-06-02  1.312510 -0.113314 -0.021289  5.0  0.993185
2024-06-03  0.812262 -2.022891  0.745910  5.0 -1.020313
2024-06-04  0.416587  0.162038 -2.112574  5.0 -0.800631
2024-06-05 -1.108838 -0.978317  0.003675  5.0  1.171139

In [166]:
#user defined operations
df.agg(lambda x : np.mean(x) * 2, axis =1 )

2024-05-27    1.965094
2024-05-28    2.569469
2024-05-29    1.867225
2024-05-30    1.187785
2024-05-31    3.266605
2024-06-01    1.394802
2024-06-02    2.868437
2024-06-03    1.405988
2024-06-04    1.066168
2024-06-05    1.635064
Freq: D, dtype: float64

In [167]:
df.transform(lambda x : x * 2 )

                   A         B         C     D         E
2024-05-27  0.000000  0.000000 -1.638771  10.0  1.464241
2024-05-28 -1.715480  0.947892  3.013765  10.0  0.601167
2024-05-29 -1.734826  0.710355  0.852124  10.0 -0.491529
2024-05-30 -2.020305  1.974470 -0.493219  10.0 -3.522020
2024-05-31  0.651309  1.524245  3.707330  10.0  0.450140
2024-06-01 -2.064724  0.891729 -0.922736  10.0 -0.930261
2024-06-02  2.625020 -0.226629 -0.042579  10.0  1.986370
2024-06-03  1.624524 -4.045781  1.491821  10.0 -2.040626
2024-06-04  0.833174  0.324076 -4.225148  10.0 -1.601262
2024-06-05 -2.217676 -1.956633  0.007350  10.0  2.342278

In [168]:
df.mean(axis = 1)

2024-05-27    0.982547
2024-05-28    1.284734
2024-05-29    0.933612
2024-05-30    0.593893
2024-05-31    1.633302
2024-06-01    0.697401
2024-06-02    1.434218
2024-06-03    0.702994
2024-06-04    0.533084
2024-06-05    0.817532
Freq: D, dtype: float64

In [169]:
#value counts
s = pd.Series (np.random.randint(1, 6, size = 10))
s

0    1
1    4
2    5
3    5
4    4
5    5
6    2
7    3
8    3
9    4
dtype: int32

In [170]:
s.value_counts()

4    3
5    3
3    2
1    1
2    1
Name: count, dtype: int64

In [171]:
#string methods
s = pd.Series(['A', 'B', 'C', 'D', 'E'])
s

0    A
1    B
2    C
3    D
4    E
dtype: object

In [172]:
s.str.lower()

0    a
1    b
2    c
3    d
4    e
dtype: object

In [173]:
#concat
a = pd.DataFrame(np.random.randn(4,5))
a

          0         1         2         3         4
0  1.149805  0.709377  1.360127 -0.847117  0.417396
1 -1.126009 -0.272687 -1.428218  1.022520 -0.280160
2 -0.356703 -0.176383 -0.610931  0.514174 -0.344354
3 -1.120314  0.026609 -1.268969 -0.175450  0.131430

In [174]:
b = pd.DataFrame(np.random.randn(4,5))
b

          0         1         2         3         4
0  0.026281  0.189194 -1.406819 -0.688309  0.137963
1 -0.617133  0.783295 -0.036397 -0.266907 -0.775221
2 -0.858906 -0.685211  0.354858  0.278463 -0.155481
3  0.121872  0.261319  0.701324  2.255572  1.736304

In [175]:
pd.concat([a,b], axis = 1)

,0,1,2,3,4,0,1,2,3,4
0,1.149805,0.709377,1.360127,-0.847117,0.417396,0.026281,0.189194,-1.406819,-0.688309,0.137963
1,-1.126009,-0.272687,-1.428218,1.022520,-0.280160,-0.617133,0.783295,-0.036397,-0.266907,-0.775221
2,-0.356703,-0.176383,-0.610931,0.514174,-0.344354,-0.858906,-0.685211,0.354858,0.278463,-0.155481
3,-1.120314,0.026609,-1.268969,-0.175450,0.131430,0.121872,0.261319,0.701324,2.255572,1.736304

In [176]:
#merge (joins)
df1 = pd.DataFrame({
    'ID': [1, 2, 3, 4],
    'Name': ['Alice', 'Bob', 'Charlie', 'David']
})

df1

   ID     Name
0   1    Alice
1   2      Bob
2   3  Charlie
3   4    David

In [177]:
df2 = pd.DataFrame({
    'ID': [3, 4, 5, 6],
    'Age': [23, 34, 45, 56]
})

df2

   ID  Age
0   3   23
1   4   34
2   5   45
3   6   56

In [178]:
pd.merge(df1, df2, how = 'outer', on = 'ID')

   ID     Name   Age
0   1    Alice   NaN
1   2      Bob   NaN
2   3  Charlie  23.0
3   4    David  34.0
4   5      NaN  45.0
5   6      NaN  56.0

In [179]:
#grouping
data = pd.DataFrame({
    'Employee': ['Alice', 'Bob', 'Charlie', 'David', 'Eve', 'Frank', 'Grace', 'Heidi'],
    'Department': ['HR', 'Engineering', 'Engineering', 'HR', 'HR', 'Marketing', 'Engineering', 'Marketing'],
    'Salary': [70000, 80000, 120000, 65000, 90000, 75000, 110000, 60000],
    'Age': [25, 32, 45, 28, 35, 40, 29, 31]
})

data

  Employee   Department  Salary  Age
0    Alice           HR   70000   25
1      Bob  Engineering   80000   32
2  Charlie  Engineering  120000   45
3    David           HR   65000   28
4      Eve           HR   90000   35
5    Frank    Marketing   75000   40
6    Grace  Engineering  110000   29
7    Heidi    Marketing   60000   31

In [180]:
data.groupby('Department')['Salary'].sum()

Department
Engineering    310000
HR             225000
Marketing      135000
Name: Salary, dtype: int64

In [181]:
data.groupby(['Department','Employee'])['Salary'].sum()

Department   Employee
Engineering  Bob          80000
             Charlie     120000
             Grace       110000
HR           Alice        70000
             David        65000
             Eve          90000
Marketing    Frank        75000
             Heidi        60000
Name: Salary, dtype: int64

In [182]:
data.groupby(['Department']).agg({'Employee' : 'count', 'Salary' : 'sum'})

             Employee  Salary
Department
Engineering         3  310000
HR                  3  225000
Marketing           2  135000

In [183]:
#stack
index = pd.MultiIndex.from_tuples(
    [('Group 1', 'A'), ('Group 1', 'B'), ('Group 2', 'A'), ('Group 2', 'B')],
    names=['Group', 'Subgroup']
)

data = {
    'Value 1': [10, 20, 30, 40],
    'Value 2': [100, 200, 300, 400]
}

d = pd.DataFrame(data, index=index)

d

                  Value 1  Value 2
Group   Subgroup
Group 1 A              10      100
        B              20      200
Group 2 A              30      300
        B              40      400

In [184]:
stacked = d.stack()
stacked

Group    Subgroup
Group 1  A         Value 1     10
                   Value 2    100
         B         Value 1     20
                   Value 2    200
Group 2  A         Value 1     30
                   Value 2    300
         B         Value 1     40
                   Value 2    400
dtype: int64

In [185]:
#unstack
stacked.unstack()

                  Value 1  Value 2
Group   Subgroup
Group 1 A              10      100
        B              20      200
Group 2 A              30      300
        B              40      400

In [186]:
stacked.unstack(1)

Subgroup           A    B
Group
Group 1 Value 1   10   20
        Value 2  100  200
Group 2 Value 1   30   40
        Value 2  300  400

In [187]:
stacked.unstack(0)

Group             Group 1  Group 2
Subgroup
A        Value 1       10       30
         Value 2      100      300
B        Value 1       20       40
         Value 2      200      400

In [188]:
#pivot

data = pd.DataFrame({
    'Date': ['2024-01-01', '2024-01-01', '2024-01-02', '2024-01-02', '2024-01-03', '2024-01-03'],
    'Store': ['Store A', 'Store B', 'Store A', 'Store B', 'Store A', 'Store B'],
    'Item': ['Item 1', 'Item 2', 'Item 1', 'Item 2', 'Item 1', 'Item 2'],
    'Sales': [150, 200, 130, 210, 170, 220]
})

data

         Date    Store    Item  Sales
0  2024-01-01  Store A  Item 1    150
1  2024-01-01  Store B  Item 2    200
2  2024-01-02  Store A  Item 1    130
3  2024-01-02  Store B  Item 2    210
4  2024-01-03  Store A  Item 1    170
5  2024-01-03  Store B  Item 2    220

In [189]:
data.pivot(index = 'Date', columns = 'Store', values = 'Sales')

Store       Store A  Store B
Date
2024-01-01      150      200
2024-01-02      130      210
2024-01-03      170      220

In [190]:
#melt (unpivot)
data = pd.DataFrame({
    'Product': ['A', 'B', 'C'],
    'January': [150, 200, 300],
    'February': [180, 210, 310],
    'March': [170, 220, 320]
})
data

  Product  January  February  March
0       A      150       180    170
1       B      200       210    220
2       C      300       310    320

In [191]:
data.melt(id_vars = 'Product', var_name = 'Month', value_name = 'Sales')

  Product     Month  Sales
0       A   January    150
1       B   January    200
2       C   January    300
3       A  February    180
4       B  February    210
5       C  February    310
6       A     March    170
7       B     March    220
8       C     March    320

In [192]:
#time series

rng = pd.date_range('1/1/2024', periods = 5, freq = 's') #it will add one day upto 5 count and freq denotes time/method

In [193]:
rng = pd.date_range('1/1/2024', periods = 5, freq = 'D')
rng

DatetimeIndex(['2024-01-01', '2024-01-02', '2024-01-03', '2024-01-04',
               '2024-01-05'],
              dtype='datetime64[ns]', freq='D')

In [194]:
rng = pd.date_range("1/1/2012", periods=10, freq="5min")
rng

DatetimeIndex(['2012-01-01 00:00:00', '2012-01-01 00:05:00',
               '2012-01-01 00:10:00', '2012-01-01 00:15:00',
               '2012-01-01 00:20:00', '2012-01-01 00:25:00',
               '2012-01-01 00:30:00', '2012-01-01 00:35:00',
               '2012-01-01 00:40:00', '2012-01-01 00:45:00'],
              dtype='datetime64[ns]', freq='5min')

In [195]:
ts = pd.Series(np.random.randint(0, 500, len(rng)), index=rng) 
ts

2012-01-01 00:00:00      4
2012-01-01 00:05:00     68
2012-01-01 00:10:00    397
2012-01-01 00:15:00    378
2012-01-01 00:20:00     89
2012-01-01 00:25:00    265
2012-01-01 00:30:00    330
2012-01-01 00:35:00    388
2012-01-01 00:40:00    365
2012-01-01 00:45:00    126
Freq: 5min, dtype: int32

In [196]:
ts.resample('20min').sum() #it calculates the sum for every 10 min

2012-01-01 00:00:00     847
2012-01-01 00:20:00    1072
2012-01-01 00:40:00     491
Freq: 20min, dtype: int32

In [197]:
ts_utc = ts.tz_localize('utc')
ts_utc

2012-01-01 00:00:00+00:00      4
2012-01-01 00:05:00+00:00     68
2012-01-01 00:10:00+00:00    397
2012-01-01 00:15:00+00:00    378
2012-01-01 00:20:00+00:00     89
2012-01-01 00:25:00+00:00    265
2012-01-01 00:30:00+00:00    330
2012-01-01 00:35:00+00:00    388
2012-01-01 00:40:00+00:00    365
2012-01-01 00:45:00+00:00    126
Freq: 5min, dtype: int32

In [198]:
ts_utc.tz_convert('US/Eastern')

2011-12-31 19:00:00-05:00      4
2011-12-31 19:05:00-05:00     68
2011-12-31 19:10:00-05:00    397
2011-12-31 19:15:00-05:00    378
2011-12-31 19:20:00-05:00     89
2011-12-31 19:25:00-05:00    265
2011-12-31 19:30:00-05:00    330
2011-12-31 19:35:00-05:00    388
2011-12-31 19:40:00-05:00    365
2011-12-31 19:45:00-05:00    126
Freq: 5min, dtype: int32

In [199]:
rng = pd.date_range('1/1/2024', periods = 5, freq = 'D')
rng

DatetimeIndex(['2024-01-01', '2024-01-02', '2024-01-03', '2024-01-04',
               '2024-01-05'],
              dtype='datetime64[ns]', freq='D')

In [200]:
rng + pd.offsets.BusinessDay(5) #it will add 5 days and neglect the week ends and give output

DatetimeIndex(['2024-01-08', '2024-01-09', '2024-01-10', '2024-01-11',
               '2024-01-12'],
              dtype='datetime64[ns]', freq=None)

In [201]:
#categoricals

df = pd.DataFrame({'id' : [1,2,3,4],
                   'grade' : ['a', 'a', 'c', 'd']
                   })

df

   id grade
0   1     a
1   2     a
2   3     c
3   4     d

In [202]:
df['grade']

0    a
1    a
2    c
3    d
Name: grade, dtype: object

In [203]:
df['new_grade'] = df['grade'].astype('category')
df['new_grade']

0    a
1    a
2    c
3    d
Name: new_grade, dtype: category
Categories (3, object): ['a', 'c', 'd']

In [204]:
new = ['excellent', 'good', 'learn more']
df['new_grade'] = df['new_grade'].cat.rename_categories(new)
df['new_grade']

0     excellent
1     excellent
2          good
3    learn more
Name: new_grade, dtype: category
Categories (3, object): ['excellent', 'good', 'learn more']

In [205]:
df['new_grade'] = df['new_grade'].cat.rename_categories(['excellent', 'good', 'learn more'])
df['new_grade']

0     excellent
1     excellent
2          good
3    learn more
Name: new_grade, dtype: category
Categories (3, object): ['excellent', 'good', 'learn more']

In [206]:
df.groupby(df['new_grade'], observed= False).size()

new_grade
excellent     2
good          1
learn more    1
dtype: int64

In [207]:
#windowing operations

a = pd.Series(range(5))
a

0    0
1    1
2    2
3    3
4    4
dtype: int64

In [208]:
a.rolling(window = 2).sum()

0    NaN
1    1.0
2    3.0
3    5.0
4    7.0
dtype: float64

In [209]:
for window in a.rolling(window = 2): #this is how window runs
  print(window)

0    0
dtype: int64
0    0
1    1
dtype: int64
1    1
2    2
dtype: int64
2    2
3    3
dtype: int64
3    3
4    4
dtype: int64

In [220]:
s = pd.Series(range (7), index = pd.date_range('01/01/2022', periods = 7, freq = 'D'))  
s

2022-01-01    0
2022-01-02    1
2022-01-03    2
2022-01-04    3
2022-01-05    4
2022-01-06    5
2022-01-07    6
Freq: D, dtype: int64

In [242]:
s.rolling(2).sum() #running total

2022-01-01     NaN
2022-01-02     1.0
2022-01-03     3.0
2022-01-04     5.0
2022-01-05     7.0
2022-01-06     9.0
2022-01-07    11.0
Freq: D, dtype: float64

In [235]:
a = pd.DataFrame({'a' : ['a','b','a','b','b', 'a'], 'b': range(6)})
a

   a  b
0  a  0
1  b  1
2  a  2
3  b  3
4  b  4
5  a  5

In [236]:
a.groupby('a').expanding().sum() #expanding --> cumulative sum

       b
a
a 0  0.0
  2  2.0
  5  7.0
b 1  1.0
  3  4.0
  4  8.0

In [1]:
import pandas as pd

# Four DataFrames
df1 = pd.DataFrame({'key1': ['A', 'B', 'C', 'D'], 'key2': ['X', 'Y', 'Z', 'W'], 'value1': [1, 2, 3, 4]})
df2 = pd.DataFrame({'key3': ['B', 'D', 'E', 'F'], 'key4': ['Y', 'W', 'X', 'Z'], 'value2': [5, 6, 7, 8]})
df3 = pd.DataFrame({'key5': ['C', 'D', 'E', 'G'], 'key6': ['Z', 'W', 'X', 'Y'], 'value3': [9, 10, 11, 12]})
df4 = pd.DataFrame({'key7': ['D', 'E', 'F', 'H'], 'key8': ['W', 'X', 'Z', 'Y'], 'value4': [13, 14, 15, 16]})

  key1 key2  value1 key3 key4  value2 key5 key6  value3 key7 key8  value4
0    D    W       4    D    W       6    D    W      10    D    W      13

In [3]:
df1

  key1 key2  value1
0    A    X       1
1    B    Y       2
2    C    Z       3
3    D    W       4

In [4]:
df2

  key3 key4  value2
0    B    Y       5
1    D    W       6
2    E    X       7
3    F    Z       8

In [5]:
df3

  key5 key6  value3
0    C    Z       9
1    D    W      10
2    E    X      11
3    G    Y      12

In [6]:
df4

  key7 key8  value4
0    D    W      13
1    E    X      14
2    F    Z      15
3    H    Y      16

In [7]:
# Merging the four DataFrames
merged_df = pd.merge(pd.merge(pd.merge(df1, df2, left_on=['key1', 'key2'], right_on=['key3', 'key4'], how='inner'),
                               df3, left_on=['key1', 'key2'], right_on=['key5', 'key6'], how='inner'),
                     df4, left_on=['key1', 'key2'], right_on=['key7', 'key8'], how='inner')

print(merged_df)

  key1 key2  value1 key3 key4  value2 key5 key6  value3 key7 key8  value4
0    D    W       4    D    W       6    D    W      10    D    W      13